UncleGrumpy/AtomVM/src/platforms/esp32/components/avm_builtins/network_driver.c
    term RSSI_ATOM = make_atom(ctx->global, ATOM_STR("\x4", "rssi"));
    term AUTHMODE_ATOM = make_atom(ctx->global, ATOM_STR("\x8", "authmode"));
    term BSSID_ATOM = make_atom(ctx->global, ATOM_STR("\x5", "bssid"));
    term CHANNEL_ATOM = make_atom(ctx->global, ATOM_STR("\x7", "channel"));

    term networks_data_list = term_nil();
    if (num_results == 0) {
        term rssi_tuple = port_create_tuple2(ctx, RSSI_ATOM, UNDEFINED_ATOM);
        term auth_tuple = port_create_tuple2(ctx, AUTHMODE_ATOM, UNDEFINED_ATOM);
        term bssid_tuple = port_create_tuple2(ctx, BSSID_ATOM, UNDEFINED_ATOM);
        term chan_tuple = port_create_tuple2(ctx, CHANNEL_ATOM, UNDEFINED_ATOM);
        term ap_data = term_nil();
        ap_data = term_list_prepend(chan_tuple, ap_data, &ctx->heap);
        ap_data = term_list_prepend(bssid_tuple, ap_data, &ctx->heap);
        ap_data = term_list_prepend(auth_tuple, ap_data, &ctx->heap);
        ap_data = term_list_prepend(rssi_tuple, ap_data, &ctx->heap);
        term ap_tuple = port_create_tuple2(ctx, NONE_ATOM, ap_data);
        networks_data_list = term_list_prepend(ap_tuple, networks_data_list, &ctx->heap);
    } else {
        for (int i = num_results - 1; i >= 0; i--) {
            term ssid;
            size_t ssid_size = strlen((const char *) ap_info[i].ssid);
            if (ssid_size > 0) {
                ssid = term_from_string(ap_info[i].ssid, ssid_size, &ctx->heap);
                ESP_LOGD(TAG, "Adding SSID: %s", ap_info[i].ssid);
            } else {
                const char *hidden_ap = "(hidden)";
                ssid = term_from_string((const uint8_t *)hidden_ap, (uint16_t) strlen(hidden_ap), &ctx->heap);
                ESP_LOGD(TAG, "Adding SSID: %s", hidden_ap);
            }

            term rssi = term_from_int(ap_info[i].rssi);
            term rssi_tuple = port_create_tuple2(ctx, RSSI_ATOM, rssi);
            ESP_LOGD(TAG, "Adding RSSI: %i", ap_info[i].rssi);

            term authmode = authmode_to_atom_term(ctx, ap_info[i].authmode);
            term auth_tuple = port_create_tuple2(ctx, AUTHMODE_ATOM, authmode);
            ESP_LOGD(TAG, "Adding auth mode: %i", ap_info[i].authmode);

            term bssid = term_from_literal_binary((const void *) ap_info[i].bssid, sizeof(ap_info[i].bssid), &ctx->heap, ctx->global);
            term bssid_tuple = port_create_tuple2(ctx, BSSID_ATOM, bssid);
            ESP_LOGI(TAG, "Adding BSSID: %02x:%02x:%02x:%02x:%02x:%02x", ap_info[i].bssid[0], ap_info[i].bssid[1], ap_info[i].bssid[2], ap_info[i].bssid[3], ap_info[i].bssid[4], ap_info[i].bssid[5]);

            term channel = term_from_int32((int32_t) ap_info[i].primary);
            term chan_tuple = port_create_tuple2(ctx, CHANNEL_ATOM, channel);
            ESP_LOGD(TAG, "Adding Channel: %i", ap_info[i].primary);

            term ap_data = term_nil();
            ap_data = term_list_prepend(chan_tuple, ap_data, &ctx->heap);
            ap_data = term_list_prepend(bssid_tuple, ap_data, &ctx->heap);
            ap_data = term_list_prepend(auth_tuple, ap_data, &ctx->heap);
            ap_data = term_list_prepend(rssi_tuple, ap_data, &ctx->heap);

            term ap_tuple = port_create_tuple2(ctx, ssid, ap_data);
            networks_data_list = term_list_prepend(ap_tuple, networks_data_list, &ctx->heap);
        }
    }
    term scan_results = port_create_tuple2(ctx, term_from_int32(num_results), networks_data_list);
    term ret = port_create_tuple2(ctx, OK_ATOM, scan_results);

    port_send_reply(ctx, pid, ref, ret);
}

static NativeHandlerResult consume_mailbox(Context *ctx)
{
    bool cmd_terminate = false;
    Message *message = mailbox_first(&ctx->mailbox);
    term msg = message->message;

    if (UNLIKELY(!term_is_tuple(msg) || term_get_tuple_arity(msg) != 3)) {
        ESP_LOGW(TAG, "Invalid message.  Ignoring.");
        return NativeContinue;
    }

    //TODO: port this code to standard port (and gen_message)
    term pid = term_get_tuple_element(msg, 0);
    term ref = term_get_tuple_element(msg, 1);
    term cmd = term_get_tuple_element(msg, 2);
    term cmd_term = term_invalid_term();
    term config = term_invalid_term();

    if ((term_is_tuple(cmd) && term_get_tuple_arity(cmd) == 2) || term_is_atom(cmd)) {

        if (term_is_atom(cmd)) {
            cmd_term = cmd;
        } else {
            cmd_term = term_get_tuple_element(cmd, 0);
            config = term_get_tuple_element(cmd, 1);
        }

        enum network_cmd cmd = interop_atom_term_select_int(cmd_table, cmd_term, ctx->global);
        switch (cmd) {
            case NetworkStartCmd:
                start_network(ctx, pid, ref, config);
                break;
            case NetworkRssiCmd:
                get_sta_rssi(ctx, pid, ref);
                break;
            case NetworkStopCmd:
                cmd_terminate = true;
                stop_network(ctx);
				break;
            case NetworkScanCmd:
                wifi_scan(ctx, pid, ref, config);
                break;
            case StaHaltCmd:
                sta_disconnect(ctx, pid, ref);
                break;
            case StaConnectCmd:
                if (term_is_invalid_term(config)) {
                    sta_reconnect(ctx, pid, ref);
                } else {
                    sta_connect(ctx, pid, ref, config);
                }
                break;

            default: {
                ESP_LOGE(TAG, "Unrecognized command: %x", cmd);
                // {Ref, {error, badarg}}
                size_t heap_size = TUPLE_SIZE(2) + REF_SIZE + TUPLE_SIZE(2);
                if (UNLIKELY(memory_ensure_free(ctx, heap_size) != MEMORY_GC_OK)) {
                    ESP_LOGE(TAG, "Unable to allocate heap space for error; no message sent");
                    return NativeContinue;
                }
                port_send_reply(ctx, pid, ref, port_create_error_tuple(ctx, BADARG_ATOM));
            }
        }
    } else {
        // {Ref, {error, badarg}}
        size_t heap_size = TUPLE_SIZE(2) + REF_SIZE + TUPLE_SIZE(2);
        if (UNLIKELY(memory_ensure_free(ctx, heap_size) != MEMORY_GC_OK)) {
            ESP_LOGE(TAG, "Unable to allocate heap space for error; no message sent");
            return NativeContinue;
        }
        port_send_reply(ctx, pid, ref, port_create_error_tuple(ctx, BADARG_ATOM));
    }

    // TODO: handle close with new API

    mailbox_remove_message(&ctx->mailbox, &ctx->heap);

    return cmd_terminate ? NativeTerminate : NativeContinue;
}

//
// Entrypoints
//

void network_driver_init(GlobalContext *global)
{
    esp_err_t err;

    if ((err = esp_netif_init()) != ESP_OK) {
        ESP_LOGE(TAG, "Failed to initialize network interface %d", err);
        AVM_ABORT();
    } else {
        ESP_LOGI(TAG, "Initialized network interface");
    }
    err = esp_event_loop_create_default();
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        ESP_LOGE(TAG, "Failed to create default event loop (err=%d)", err);
        AVM_ABORT();
    } else {
        ESP_LOGI(TAG, "Created default event loop");
    }
}

Context *network_driver_create_port(GlobalContext *global, term opts)
{
    UNUSED(opts);

    Context *ctx = context_new(global);
    ctx->native_handler = consume_mailbox;
    ctx->platform_data = NULL;
    return ctx;
}

REGISTER_PORT_DRIVER(network, network_driver_init, NULL, network_driver_create_port)

#endif
